'''原神的游戏数据'''

'''角色名称
遵照格式： id: [官译简体, 日文原名, 英文名(罗马音), 常见别称,] （<-依此顺序）目前只写了官译简体及英文
'''
CHARA_NAME = {
    101: ["阿贝多", "Albedo"],
    102: ["安柏", "Amber"],
    103: ["芭芭拉", "Barbara"],
    104: ["北斗", "Beidou"],
    105: ["班尼特", "Bennett"],
    106: ["重云", "Chongyun"],
    107: ["迪卢克", "Diluc"],
    108: ["迪奥娜", "Diona"],
    109: ["菲谢尔", "Fischl"],
    110: ["琴", "Jean"],
    111: ["凯亚", "Kaeya"],
    112: ["刻晴", "Keqing"],
    113: ["可莉", "Klee"],
    114: ["丽莎", "Lisa"],
    115: ["莫娜", "Mona"],
    116: ["凝光", "Ningguang"],
    117: ["七七", "Qiqi"],
    118: ["雷泽", "Razor"],
    119: ["砂糖", "Sucrose"],
    120: ["达达利亚", "Tartaglia"],
    121: ["荧", "Lumine"],
    122: ["空", "Aether"],
    123: ["温迪", "Venti"],
    124: ["香菱", "Xiangling"],
    125: ["行秋", "Xingqiu"],
    126: ["辛焱", "Xinyan"],
    127: ["钟离", "Zhongli"],
    128: ["派蒙", "Paimon"],
    129: ["诺艾尔", "Noelle"],
    130: ["甘雨", "Ganyu"],
    131: ["魈", "Xiao"],
    132: ["派蒙（胡桃）", "Paimon(Hutao)", "派蒙"],
    133: ["胡桃", "Hutao"],
    134: ["派蒙(耶格尔)", "Paimon(yeager)", "派蒙"],
    135: ["派蒙(旅行者)", "Paimon(traveler)", "派蒙"],
    136: ["罗莎莉亚", "Rosaria"],
    137: ["烟绯", "Yanfei"],
    138: ["优菈", "Eula"],
    139: ["派蒙(刻晴)", "Paimon(Keqing)", "派蒙"],
}

CHARA_PROFILE = {
    101: {"名字": "阿贝多", "所属国家": "蒙德", "生日": "9月13日", "角色属性": "岩", "武器类型": "单手剑", "命之座": "白垩之子座", "发色": "银发", "瞳色": "蓝瞳",
          "日文声优": "野岛健儿", "中文声优": "Mace", "称号": "白垩之子", "池子类型": "限定", "性别": "男"},
    102: {"名字": "安柏", "所属国家": "蒙德", "生日": "8月10日", "角色属性": "火", "武器类型": "弓", "命之座": "小兔座", "发色": "棕发", "瞳色": "金瞳",
          "日文声优": "石见舞菜香", "中文声优": "牛奶君", "称号": "侦查骑士", "池子类型": "常驻", "性别": "女"},
    103: {"名字": "芭芭拉", "所属国家": "蒙德", "生日": "7月5日", "角色属性": "水", "武器类型": "法器", "命之座": "金杯座", "发色": "金发", "瞳色": "蓝瞳",
          "日文声优": "鬼头明里", "中文声优": "宋媛媛", "称号": "内鬼", "池子类型": "常驻和限定", "性别": "女"},
    104: {"名字": "北斗", "所属国家": "璃月", "生日": "2月14日", "角色属性": "雷", "武器类型": "双手剑", "命之座": "南天海山座", "发色": "黑发", "瞳色": "红瞳",
          "日文声优": "小清水亚美", "中文声优": "唐雅菁", "称号": "无冕的龙王", "池子类型": "常驻和限定", "性别": "女"},
    105: {"名字": "班尼特", "所属国家": "蒙德", "生日": "2月29日", "角色属性": "火", "武器类型": "单手剑", "命之座": "险路座", "发色": "金发", "瞳色": "绿瞳",
          "日文声优": "逢坂良太", "中文声优": "穆雪婷", "称号": "命运试金石", "池子类型": "常驻和限定", "性别": "男"},
    106: {"名字": "重云", "所属国家": "璃月", "生日": "9月7日", "角色属性": "冰", "武器类型": "双手剑", "命之座": "乾坤锋座", "发色": "蓝发", "瞳色": "蓝瞳",
          "日文声优": "齐藤壮马", "中文声优": "kinsen", "称号": "雪融有踪", "池子类型": "常驻和限定", "性别": "男"},
    107: {"名字": "迪卢克", "所属国家": "蒙德", "生日": "4月30日", "角色属性": "火", "武器类型": "双手剑", "命之座": "夜枭座", "发色": "红发", "瞳色": "红瞳",
          "日文声优": "小野贤章", "中文声优": "马洋", "称号": "正义人", "池子类型": "常驻", "性别": "男"},
    108: {"名字": "迪奥娜", "所属国家": "蒙德", "生日": "1月18日", "角色属性": "冰", "武器类型": "弓", "命之座": "小猫座", "发色": "粉发", "瞳色": "绿瞳",
          "日文声优": "井泽诗织", "中文声优": "诺亚", "称号": "酒业杀手", "池子类型": "常驻和限定", "性别": "女"},
    109: {"名字": "菲谢尔", "所属国家": "蒙德", "生日": "5月27日", "角色属性": "雷", "武器类型": "弓", "命之座": "幻鸦座", "发色": "金发", "瞳色": "绿瞳",
          "日文声优": "内田真礼", "中文声优": "Mace", "称号": "断罪之皇女", "池子类型": "常驻和限定", "性别": "女"},
    110: {"名字": "琴", "所属国家": "蒙德", "生日": "3月14日", "角色属性": "风", "武器类型": "单手剑", "命之座": "幼狮座", "发色": "金发", "瞳色": "蓝瞳",
          "日文声优": "斋藤千和", "中文声优": "林簌", "称号": "蒲公英骑士", "池子类型": "常驻", "性别": "女"},
    111: {"名字": "凯亚", "所属国家": "蒙德", "生日": "11月30日", "角色属性": "冰", "武器类型": "单手剑", "命之座": "孔雀羽座", "发色": "蓝发", "瞳色": "蓝瞳",
          "日文声优": "鸟海浩辅", "中文声优": "孙晔", "称号": "踏冰渡海真君", "池子类型": "常驻", "性别": "男"},
    112: {"名字": "刻晴", "所属国家": "璃月", "生日": "11月20日", "角色属性": "雷", "武器类型": "单手剑", "命之座": "金紫定垂座", "发色": "紫发", "瞳色": "紫瞳",
          "日文声优": "喜多村英梨", "中文声优": "谢莹", "称号": "璃月刮痧真君", "池子类型": "常驻和限定", "性别": "女"},
    113: {"名字": "可莉", "所属国家": "蒙德", "生日": "7月27日", "角色属性": "火", "武器类型": "法器", "命之座": "四叶草座", "发色": "金发", "瞳色": "红瞳",
          "日文声优": "久野美咲", "中文声优": "fa玲", "称号": "放火烧山真君", "池子类型": "限定", "性别": "女"},
    114: {"名字": "丽莎", "所属国家": "蒙德", "生日": "6月9日", "角色属性": "雷", "武器类型": "法器", "命之座": "沙漏座", "发色": "棕发", "瞳色": "绿瞳",
          "日文声优": "田中理惠", "中文声优": "钟可", "称号": "蔷薇魔女", "池子类型": "常驻", "性别": "女"},
    115: {"名字": "莫娜", "所属国家": "蒙德", "生日": "8月31日", "角色属性": "水", "武器类型": "法器", "命之座": "映天座", "发色": "紫发", "瞳色": "绿瞳",
          "日文声优": "小原好美", "中文声优": "陈婷婷", "称号": "星天水镜", "池子类型": "常驻", "性别": "女"},
    116: {"名字": "凝光", "所属国家": "璃月", "生日": "8月26日", "角色属性": "岩", "武器类型": "法器", "命之座": "玑衡仪座", "发色": "银发", "瞳色": "红瞳",
          "日文声优": "大原沙耶香", "中文声优": "杜冥鸦", "称号": "天权星", "池子类型": "常驻和限定", "性别": "女"},
    117: {"名字": "七七", "所属国家": "璃月", "生日": "3月3日", "角色属性": "冰", "武器类型": "单手剑", "命之座": "三清铃座", "发色": "紫发", "瞳色": "粉瞳",
          "日文声优": "田村由香里", "中文声优": "宴宁", "称号": "冻冻回魂夜", "池子类型": "常驻", "性别": "女"},
    118: {"名字": "雷泽", "所属国家": "蒙德", "生日": "9月9日", "角色属性": "雷", "武器类型": "双手剑", "命之座": "小狼座", "发色": "银发", "瞳色": "红瞳",
          "日文声优": "内山昂辉", "中文声优": "周帅", "称号": "奔狼领的传说", "池子类型": "常驻和限定", "性别": "男"},
    119: {"名字": "砂糖", "所属国家": "蒙德", "生日": "11月26日", "角色属性": "风", "武器类型": "法器", "命之座": "烧瓶座", "发色": "绿发", "瞳色": "橙瞳",
          "日文声优": "藤田茜", "中文声优": "小敢", "称号": "雷莹术士", "池子类型": "常驻和限定", "性别": "女"},
    120: {"名字": "达达利亚", "所属国家": "至冬", "生日": "7月20日", "角色属性": "水", "武器类型": "弓", "命之座": "鲸天座", "发色": "黄发", "瞳色": "蓝瞳",
          "日文声优": "木村良平", "中文声优": "鱼冻", "称号": "玩具销售员", "池子类型": "限定", "性别": "男"},
    121: {"名字": "荧", "所属国家": "???", "生日": "???", "角色属性": "???", "武器类型": "单手剑", "命之座": "旅人座", "发色": "金发", "瞳色": "橙瞳",
          "日文声优": "悠木碧", "中文声优": "宴宁", "称号": "妹妹", "池子类型": "???", "性别": "女"},
    122: {"名字": "空", "所属国家": "???", "生日": "???", "角色属性": "???", "武器类型": "单手剑", "命之座": "旅人座", "发色": "金发", "瞳色": "橙瞳",
          "日文声优": "堀江瞬", "中文声优": "鹿喑", "称号": "哥哥", "池子类型": "???", "性别": "男"},
    123: {"名字": "温迪", "所属国家": "蒙德", "生日": "6月16日", "角色属性": "风", "武器类型": "弓", "命之座": "歌仙座", "发色": "绿发", "瞳色": "绿瞳",
          "日文声优": "村濑步", "中文声优": "喵☆酱", "称号": "摸鱼", "池子类型": "限定", "性别": "男"},
    124: {"名字": "香菱", "所属国家": "璃月", "生日": "11月2日", "角色属性": "火", "武器类型": "长柄武器", "命之座": "长杓座", "发色": "蓝发", "瞳色": "金瞳",
          "日文声优": "小泽亚李", "中文声优": "小N", "称号": "洲际导弹真君", "池子类型": "常驻和限定", "性别": "女"},
    125: {"名字": "行秋", "所属国家": "璃月", "生日": "10月9日", "角色属性": "水", "武器类型": "单手剑", "命之座": "锦织座", "发色": "蓝发", "瞳色": "棕瞳",
          "日文声优": "皆川纯子", "中文声优": "唐雅菁", "称号": "古华飞云", "池子类型": "常驻和限定", "性别": "男"},
    126: {"名字": "辛焱", "所属国家": "璃月", "生日": "10月16日", "角色属性": "火", "武器类型": "双手剑", "命之座": "红檀四弦座", "发色": "黑发", "瞳色": "金瞳",
          "日文声优": "高桥智秋", "中文声优": "王雅欣", "称号": "燥热旋律", "池子类型": "常驻和限定", "性别": "女"},
    127: {"名字": "钟离", "所属国家": "璃月", "生日": "12月31日", "角色属性": "岩", "武器类型": "长柄武器", "命之座": "岩王帝君座", "发色": "黑发", "瞳色": "金瞳",
          "日文声优": "前野智昭", "中文声优": "彭博", "称号": "未来战士", "池子类型": "限定", "性别": "男"},
    128: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    129: {"名字": "诺艾尔", "所属国家": "蒙德", "生日": "3月21日", "角色属性": "岩", "武器类型": "双手剑", "命之座": "心护座", "发色": "银发", "瞳色": "绿瞳",
          "日文声优": "高尾奏音", "中文声优": "宴宁", "称号": "山吹", "池子类型": "常驻和限定", "性别": "女"},
    130: {"名字": "甘雨", "所属国家": "璃月", "生日": "12月2日", "角色属性": "冰", "武器类型": "弓", "命之座": "仙麟座", "发色": "蓝发", "瞳色": "紫瞳",
          "日文声优": "上田丽奈", "中文声优": "林簌", "称号": "椰羊", "池子类型": "限定", "性别": "女"},
    131: {"名字": "魈", "所属国家": "璃月", "生日": "4月17日", "角色属性": "风", "武器类型": "长柄武器", "命之座": "金翅鹏王座", "发色": "绿发", "瞳色": "黄瞳",
          "日文声优": "松冈祯丞", "中文声优": "Kinsen", "称号": "打桩机", "池子类型": "限定", "性别": "男"},
    132: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    133: {"名字": "胡桃", "所属国家": "璃月", "生日": "7月15日", "角色属性": "火", "武器类型": "长柄武器", "命之座": "引蝶座", "发色": "褐发", "瞳色": "红",
          "日文声优": "高桥李依", "中文声优": "陶典", "称号": "雪霁梅香（暂定）", "池子类型": "限定", "性别": "女"},
    134: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    135: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    136: {"名字": "罗莎莉亚", "所属国家": "蒙德", "生日": "4月6日", "角色属性": "冰", "武器类型": "长柄武器", "命之座": "荆冠座", "发色": "白发", "瞳色": "紫瞳",
          "日文声优": "加隈亚衣", "中文声优": "张安琪", "称号": "白色史莱姆", "池子类型": "限定", "性别": "女"},
    137: {"名字": "烟绯", "所属国家": "璃月", "生日": "7月28日", "角色属性": "火", "武器类型": "法器", "命之座": "法兽座", "发色": "粉发",
          "瞳色": "绿瞳",
          "日文声优": "花守由美里", "中文声优": "苏子芜", "称号": "璃月罗翔", "池子类型": "限定", "性别": "女"},
    138: {"名字": "优菈", "所属国家": "蒙德", "生日": "10月25日", "角色属性": "冰", "武器类型": "双手剑", "命之座": "浪沫座", "发色": "蓝发",
          "瞳色": "棕瞳",
          "日文声优": "佐藤利奈", "中文声优": "子音", "称号": "游击小队队长", "池子类型": "限定", "性别": "女"}
}
UNUSE_NAME = [128, 132, 134, 135]
WEAPON_NAME = {
    1001: ["无锋剑"],
    1002: ["银剑"],
    1003: ["吃虎鱼刀"],
    1004: ["黎明神剑"],
    1005: ["旅行剑"],
    1006: ["暗铁剑"],
    1007: ["冷刃"],
    1008: ["飞天御剑"],
    1009: ["腐殖之剑"],
    1010: ["黑剑"],
    1011: ["试作斩岩"],
    1012: ["暗巷闪光"],
    1013: ["宗室长剑"],
    1014: ["铁蜂刺"],
    1015: ["笛剑"],
    1016: ["祭礼剑"],
    1017: ["匣里龙吟"],
    1018: ["降临之剑"],
    1019: ["西风剑"],
    1020: ["黑岩长剑"],
    1021: ["磐岩结绿"],
    1022: ["风鹰剑"],
    1023: ["斫峰之刃"],
    1024: ["天空之刃"],
    1025: ["训练大剑"],
    1026: ["佣兵重剑"],
    1027: ["沐浴龙血的剑"],
    1028: ["白铁大剑"],
    1029: ["铁影阔剑"],
    1030: ["飞天大御剑"],
    1031: ["以理服人"],
    1032: ["雨裁"],
    1033: ["白影剑"],
    1034: ["黑岩斩刀"],
    1035: ["宗室大剑"],
    1036: ["祭礼大剑"],
    1037: ["雪葬的星银"],
    1038: ["螭骨剑"],
    1039: ["试作古华"],
    1040: ["西风大剑"],
    1041: ["钟剑"],
    1042: ["千岩古剑"],
    1043: ["天空之傲"],
    1044: ["无工之剑"],
    1045: ["狼的末路"],
    1046: ["猎弓"],
    1047: ["历练的猎弓"],
    1048: ["信使"],
    1049: ["弹弓"],
    1050: ["反曲弓"],
    1051: ["神射手之誓"],
    1052: ["鸦羽弓"],
    1053: ["黑岩战弓"],
    1054: ["试作澹月"],
    1055: ["宗室长弓"],
    1056: ["祭礼弓"],
    1057: ["苍翠猎弓"],
    1058: ["绝弦"],
    1059: ["风花之颂"],
    1060: ["钢轮弓"],
    1061: ["西风猎弓"],
    1062: ["弓藏"],
    1063: ["终末嗟叹之诗"],
    1064: ["天空之翼"],
    1065: ["阿莫斯之弓"],
    1066: ["学徒笔记"],
    1067: ["口袋魔导书"],
    1068: ["异世界行记"],
    1069: ["翡玉法球"],
    1070: ["甲级宝珏"],
    1071: ["魔导绪论"],
    1072: ["讨龙英杰谭"],
    1073: ["万国诸海图谱"],
    1074: ["昭心"],
    1075: ["暗巷的酒与诗"],
    1076: ["宗室秘法录"],
    1077: ["流浪乐章"],
    1078: ["匣里日月"],
    1079: ["西风秘典"],
    1080: ["忍冬之果"],
    1081: ["试作金珀"],
    1082: ["祭礼残章"],
    1083: ["黑岩绯玉"],
    1084: ["四风原典"],
    1085: ["天空之卷"],
    1086: ["尘世之锁"],
    1087: ["新手长枪"],
    1088: ["铁尖枪"],
    1089: ["黑缨枪"],
    1090: ["钺矛"],
    1091: ["白缨枪"],
    1092: ["流月针"],
    1093: ["匣里灭辰"],
    1094: ["千岩长枪"],
    1095: ["试作星镰"],
    1096: ["黑岩刺枪"],
    1097: ["西风长枪"],
    1098: ["龙脊长枪"],
    1099: ["决斗之枪"],
    1100: ["宗室猎枪"],
    1101: ["护摩之杖"],
    1102: ["和璞鸢"],
    1103: ["天空之脊"],
    1104: ["贯虹之槊"],
}

WEAPON_PROFILE = {
    1001: {"名字": "无锋剑", "类型": "单手剑", "稀有度": "1星"
        , "获取途径": "初始武器赠送, 宝箱, 商店购买"
        , "初始基础攻击力": "23", "副属性": "无"},
    1002: {"名字": "银剑", "类型": "单手剑", "稀有度": "2星"
        , "获取途径": "宝箱, 商店购买"
        , "初始基础攻击力": "33", "副属性": "无"},
    1003: {"名字": "吃虎鱼刀", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "宝箱"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1004: {"名字": "黎明神剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "祈愿, 任务, （海盗密保孔雀羽之章）"
        , "初始基础攻击力": "39", "副属性": "暴击伤害"},
    1005: {"名字": "旅行剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "宝箱"
        , "初始基础攻击力": "40", "副属性": "防御力"},
    1006: {"名字": "暗铁剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "与璃月港小吃摊摊主快刀陈对话“鱼卖得怎样”, 对话"
        , "初始基础攻击力": "39", "副属性": "元素精通"},
    1007: {"名字": "冷刃", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1008: {"名字": "飞天御剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "38", "副属性": "元素充能效率"},
    1009: {"名字": "腐殖之剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "活动"
        , "初始基础攻击力": "42", "副属性": "元素充能效率"},
    1010: {"名字": "黑剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "纪行"
        , "初始基础攻击力": "42", "副属性": "暴击率"},
    1011: {"名字": "试作斩岩", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "锻造"
        , "初始基础攻击力": "44", "副属性": "物理伤害加成"},
    1012: {"名字": "暗巷闪光", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "限定祈愿"
        , "初始基础攻击力": "45", "副属性": "元素精通"},
    1013: {"名字": "宗室长剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "商城兑换"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1014: {"名字": "铁蜂刺", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "锻造"
        , "初始基础攻击力": "42", "副属性": "元素精通"},
    1015: {"名字": "笛剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1016: {"名字": "祭礼剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "41", "副属性": "元素充能效率"},
    1017: {"名字": "匣里龙吟", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1018: {"名字": "降临之剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "PS4特典奖励"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1019: {"名字": "西风剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "41", "副属性": "元素充能效率"},
    1020: {"名字": "黑岩长剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "商城兑换"
        , "初始基础攻击力": "44", "副属性": "暴击伤害"},
    1021: {"名字": "磐岩结绿", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "44", "副属性": "暴击率"},
    1022: {"名字": "风鹰剑", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "48", "副属性": "物理伤害加成"},
    1023: {"名字": "斫峰之刃", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "46", "副属性": "百分比攻击力"},
    1024: {"名字": "天空之刃", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "46", "副属性": "元素充能效率"},
    1025: {"名字": "训练大剑", "类型": "双手剑", "稀有度": "1星"
        , "获取途径": "初始武器赠送, 宝箱, 商店购买"
        , "初始基础攻击力": "23", "副属性": "无"},
    1026: {"名字": "佣兵重剑", "类型": "双手剑", "稀有度": "2星"
        , "获取途径": "宝箱, 商店购买"
        , "初始基础攻击力": "33", "副属性": "无"},
    1027: {"名字": "沐浴龙血的剑", "类型": "双手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "38", "副属性": "元素精通"},
    1028: {"名字":"白铁大剑","类型":"双手剑","稀有度":"3星"
           ,"获取途径":"宝箱"
           ,"初始基础攻击力":"39","副属性":"防御力"},
    1029: {"名字":"铁影阔剑","类型":"双手剑","稀有度":"3星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"39","副属性":"生命值"},
    1030: {"名字":"飞天大御剑","类型":"双手剑","稀有度":"3星"
           ,"获取途径":"孤云阁附近拔出, 宝箱"
           ,"初始基础攻击力":"39","副属性":"物理伤害加成"},
    1031: {"名字":"以理服人","类型":"双手剑","稀有度":"3星"
           ,"获取途径":"祈愿, 宝箱"
           ,"初始基础攻击力":"39","副属性":"攻击力"},
    1032: {"名字":"雨裁","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"42","副属性":"元素精通"},
    1033: {"名字":"白影剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"锻造"
           ,"初始基础攻击力":"42","副属性":"防御力"},
    1034: {"名字":"黑岩斩刀","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"商城兑换"
           ,"初始基础攻击力":"42","副属性":"暴击伤害"},
    1035: {"名字":"宗室大剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"商城兑换"
           ,"初始基础攻击力":"44","副属性":"百分比攻击力"},
    1036: {"名字":"祭礼大剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"44","副属性":"元素充能效率"},
    1037: {"名字":"雪葬的星银","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"锻造, 任务"
           ,"初始基础攻击力":"44","副属性":"物理伤害加成"},
    1038: {"名字":"螭骨剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"纪行"
           ,"初始基础攻击力":"42","副属性":"暴击率"},
    1039: {"名字":"试作古华","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"锻造"
           ,"初始基础攻击力":"44","副属性":"百分比攻击力"},
    1040: {"名字":"西风大剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"41","副属性":"元素充能效率"},
    1041: {"名字":"钟剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"42","副属性":"生命值"},
    1042: {"名字":"千岩古剑","类型":"双手剑","稀有度":"4星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"42","副属性":"攻击力"},
    1043: {"名字":"天空之傲","类型":"双手剑","稀有度":"5星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"48","副属性":"元素充能效率"},
    1044: {"名字":"无工之剑","类型":"双手剑","稀有度":"5星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"46","副属性":"百分比攻击力"},
    1045: {"名字":"狼的末路","类型":"双手剑","稀有度":"5星"
           ,"获取途径":"祈愿"
           ,"初始基础攻击力":"46","副属性":"百分比攻击力"},
    # 1046: {"名字":"猎弓","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"},
    # 1047: {"名字":"无锋剑","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"历练的猎弓"],
    # 1048: {"名字":"无锋剑","类型":"单手剑","稀有度":"2星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"信使"],
    # 1049: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"弹弓"],
    # 1050: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"反曲弓"],
    # 1051: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"神射手之誓"],
    # 1052: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"鸦羽弓"],
    # 1053: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑岩战弓"],
    # 1054: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"试作澹月"],
    # 1055: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"宗室长弓"],
    # 1056: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"祭礼弓"],
    # 1057: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"苍翠猎弓"],
    # 1058: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"绝弦"],
    # 1059: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"风花之颂"],
    # 1060: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"钢轮弓"],
    # 1061: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"西风猎弓"],
    # 1062: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"弓藏"],
    # 1063: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"终末嗟叹之诗"],
    # 1064: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"天空之翼"],
    # 1065: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"阿莫斯之弓"],
    # 1066: {"名字":"无锋剑","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"学徒笔记"],
    # 1067: {"名字":"无锋剑","类型":"单手剑","稀有度":"2星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"口袋魔导书"],
    # 1068: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"异世界行记"],
    # 1069: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"翡玉法球"],
    # 1070: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"甲级宝珏"],
    # 1071: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"魔导绪论"],
    # 1072: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"讨龙英杰谭"],
    # 1073: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"万国诸海图谱"],
    # 1074: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"昭心"],
    # 1075: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"暗巷的酒与诗"],
    # 1076: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"宗室秘法录"],
    # 1077: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"流浪乐章"],
    # 1078: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"匣里日月"],
    # 1079: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"西风秘典"],
    # 1080: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"忍冬之果"],
    # 1081: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"试作金珀"],
    # 1082: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"祭礼残章"],
    # 1083: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑岩绯玉"],
    # 1084: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"四风原典"],
    # 1085: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"天空之卷"],
    # 1086: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"尘世之锁"],
    # 1087: {"名字":"无锋剑","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"新手长枪"],
    # 1088: {"名字":"无锋剑","类型":"单手剑","稀有度":"2星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"铁尖枪"],
    # 1089: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑缨枪"],
    # 1090: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"钺矛"],
    # 1091: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"白缨枪"],
    # 1092: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"流月针"],
    # 1093: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"匣里灭辰"],
    # 1094: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"千岩长枪"],
    # 1095: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"试作星镰"],
    # 1096: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑岩刺枪"],
    # 1097: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"西风长枪"],
    # 1098: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"龙脊长枪"],
    # 1099: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"决斗之枪"],
    # 1100: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"宗室猎枪"],
    # 1101: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"护摩之杖"],
    # 1102: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"和璞鸢"],
    # 1103: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"天空之脊"],
    # 1104: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"贯虹之槊"],
}
