'''原神的游戏数据'''
from typing import Counter

'''角色名称
遵照格式： id: [官译简体,英文名(罗马音), 常见别称,] （<-依此顺序）目前只写了官译简体及英文
'''

UNUSE_NAME = [100, 128, 132, 134, 135, 139, 146]
CHARA_NAME = {
    101: ["阿贝多", "Albedo"],
    102: ["安柏", "Amber"],
    103: ["芭芭拉", "Barbara"],
    104: ["北斗", "Beidou"],
    105: ["班尼特", "Bennett"],
    106: ["重云", "Chongyun"],
    107: ["迪卢克", "Diluc"],
    108: ["迪奥娜", "Diona"],
    109: ["菲谢尔", "Fischl"],
    110: ["琴", "Jean"],
    111: ["凯亚", "Kaeya"],
    112: ["刻晴", "Keqing"],
    113: ["可莉", "Klee"],
    114: ["丽莎", "Lisa"],
    115: ["莫娜", "Mona"],
    116: ["凝光", "Ningguang"],
    117: ["七七", "Qiqi"],
    118: ["雷泽", "Razor"],
    119: ["砂糖", "Sucrose"],
    120: ["达达利亚", "Tartaglia"],
    121: ["荧", "Lumine"],
    122: ["空", "Aether"],
    123: ["温迪", "Venti"],
    124: ["香菱", "Xiangling"],
    125: ["行秋", "Xingqiu"],
    126: ["辛焱", "Xinyan"],
    127: ["钟离", "Zhongli"],
    128: ["派蒙", "Paimon"],
    129: ["诺艾尔", "Noelle"],
    130: ["甘雨", "Ganyu"],
    131: ["魈", "Xiao"],
    132: ["派蒙（胡桃）", "Paimon(Hutao)", "派蒙"],
    133: ["胡桃", "Hutao"],
    134: ["派蒙(耶格尔)", "Paimon(yeager)", "派蒙"],
    135: ["派蒙(旅行者)", "Paimon(traveler)", "派蒙"],
    136: ["罗莎莉亚", "Rosaria"],
    137: ["烟绯", "Yanfei"],
    138: ["优菈", "Eula"],
    139: ["派蒙(刻晴)", "Paimon(Keqing)", "派蒙"],
    140: ["宵宫", "Yoimiya"],
    141: ["神里绫华", "Kamisato_Ayaka", "神里"],
    142: ["早柚", "Sayu"],
    143: ["枫原万叶", "Kaedehara_Kazuha", "万叶"],
    144: ["雷电将军", "Raiden_Shogun", "巴尔泽布", "影"],
    145: ["九条裟罗", "Kujou_Sara"],
    146: ["派蒙(嘉然)", "Paimon(Jiaran)", "派蒙"],
    147: ["珊瑚宫心海", "Sangonomiya_Kokomi", "心海"],
    148: ["派蒙(一周年)","Paimon(OneYear)","派蒙"],
    149: ["荒泷一斗","Arataki_Itto"],
    150: ["五郎","Gorou"],
    151: ["申鹤","Shenhe"],
    152: ["云堇","Yunjin"],
    153: ["托马","Thoma"],
    154: ["埃洛伊","Aloy"]
}

CHARA_PROFILE = {
    101: {"名字": "阿贝多", "所属国家": "蒙德", "生日": "9月13日", "角色属性": "岩", "武器类型": "单手剑", "命之座": "白垩之子座", "发色": "银发", "瞳色": "蓝瞳",
          "日文声优": "野岛健儿", "中文声优": "Mace", "称号": "白垩之子", "池子类型": "限定", "性别": "男"},
    102: {"名字": "安柏", "所属国家": "蒙德", "生日": "8月10日", "角色属性": "火", "武器类型": "弓", "命之座": "小兔座", "发色": "棕发", "瞳色": "金瞳",
          "日文声优": "石见舞菜香", "中文声优": "牛奶君", "称号": "侦查骑士", "池子类型": "常驻", "性别": "女"},
    103: {"名字": "芭芭拉", "所属国家": "蒙德", "生日": "7月5日", "角色属性": "水", "武器类型": "法器", "命之座": "金杯座", "发色": "金发", "瞳色": "蓝瞳",
          "日文声优": "鬼头明里", "中文声优": "宋媛媛", "称号": "内鬼", "池子类型": "常驻和限定", "性别": "女"},
    104: {"名字": "北斗", "所属国家": "璃月", "生日": "2月14日", "角色属性": "雷", "武器类型": "双手剑", "命之座": "南天海山座", "发色": "黑发", "瞳色": "红瞳",
          "日文声优": "小清水亚美", "中文声优": "唐雅菁", "称号": "无冕的龙王", "池子类型": "常驻和限定", "性别": "女"},
    105: {"名字": "班尼特", "所属国家": "蒙德", "生日": "2月29日", "角色属性": "火", "武器类型": "单手剑", "命之座": "险路座", "发色": "金发", "瞳色": "绿瞳",
          "日文声优": "逢坂良太", "中文声优": "穆雪婷", "称号": "命运试金石", "池子类型": "常驻和限定", "性别": "男"},
    106: {"名字": "重云", "所属国家": "璃月", "生日": "9月7日", "角色属性": "冰", "武器类型": "双手剑", "命之座": "乾坤锋座", "发色": "蓝发", "瞳色": "蓝瞳",
          "日文声优": "齐藤壮马", "中文声优": "kinsen", "称号": "雪融有踪", "池子类型": "常驻和限定", "性别": "男"},
    107: {"名字": "迪卢克", "所属国家": "蒙德", "生日": "4月30日", "角色属性": "火", "武器类型": "双手剑", "命之座": "夜枭座", "发色": "红发", "瞳色": "红瞳",
          "日文声优": "小野贤章", "中文声优": "马洋", "称号": "正义人", "池子类型": "常驻", "性别": "男"},
    108: {"名字": "迪奥娜", "所属国家": "蒙德", "生日": "1月18日", "角色属性": "冰", "武器类型": "弓", "命之座": "小猫座", "发色": "粉发", "瞳色": "绿瞳",
          "日文声优": "井泽诗织", "中文声优": "诺亚", "称号": "酒业杀手", "池子类型": "常驻和限定", "性别": "女"},
    109: {"名字": "菲谢尔", "所属国家": "蒙德", "生日": "5月27日", "角色属性": "雷", "武器类型": "弓", "命之座": "幻鸦座", "发色": "金发", "瞳色": "绿瞳",
          "日文声优": "内田真礼", "中文声优": "Mace", "称号": "断罪之皇女", "池子类型": "常驻和限定", "性别": "女"},
    110: {"名字": "琴", "所属国家": "蒙德", "生日": "3月14日", "角色属性": "风", "武器类型": "单手剑", "命之座": "幼狮座", "发色": "金发", "瞳色": "蓝瞳",
          "日文声优": "斋藤千和", "中文声优": "林簌", "称号": "蒲公英骑士", "池子类型": "常驻", "性别": "女"},
    111: {"名字": "凯亚", "所属国家": "蒙德", "生日": "11月30日", "角色属性": "冰", "武器类型": "单手剑", "命之座": "孔雀羽座", "发色": "蓝发", "瞳色": "蓝瞳",
          "日文声优": "鸟海浩辅", "中文声优": "孙晔", "称号": "踏冰渡海真君", "池子类型": "常驻", "性别": "男"},
    112: {"名字": "刻晴", "所属国家": "璃月", "生日": "11月20日", "角色属性": "雷", "武器类型": "单手剑", "命之座": "金紫定垂座", "发色": "紫发", "瞳色": "紫瞳",
          "日文声优": "喜多村英梨", "中文声优": "谢莹", "称号": "璃月刮痧真君", "池子类型": "常驻和限定", "性别": "女"},
    113: {"名字": "可莉", "所属国家": "蒙德", "生日": "7月27日", "角色属性": "火", "武器类型": "法器", "命之座": "四叶草座", "发色": "金发", "瞳色": "红瞳",
          "日文声优": "久野美咲", "中文声优": "fa玲", "称号": "放火烧山真君", "池子类型": "限定", "性别": "女"},
    114: {"名字": "丽莎", "所属国家": "蒙德", "生日": "6月9日", "角色属性": "雷", "武器类型": "法器", "命之座": "沙漏座", "发色": "棕发", "瞳色": "绿瞳",
          "日文声优": "田中理惠", "中文声优": "钟可", "称号": "蔷薇魔女", "池子类型": "常驻", "性别": "女"},
    115: {"名字": "莫娜", "所属国家": "蒙德", "生日": "8月31日", "角色属性": "水", "武器类型": "法器", "命之座": "映天座", "发色": "紫发", "瞳色": "绿瞳",
          "日文声优": "小原好美", "中文声优": "陈婷婷", "称号": "星天水镜", "池子类型": "常驻", "性别": "女"},
    116: {"名字": "凝光", "所属国家": "璃月", "生日": "8月26日", "角色属性": "岩", "武器类型": "法器", "命之座": "玑衡仪座", "发色": "银发", "瞳色": "红瞳",
          "日文声优": "大原沙耶香", "中文声优": "杜冥鸦", "称号": "天权星", "池子类型": "常驻和限定", "性别": "女"},
    117: {"名字": "七七", "所属国家": "璃月", "生日": "3月3日", "角色属性": "冰", "武器类型": "单手剑", "命之座": "三清铃座", "发色": "紫发", "瞳色": "粉瞳",
          "日文声优": "田村由香里", "中文声优": "宴宁", "称号": "冻冻回魂夜", "池子类型": "常驻", "性别": "女"},
    118: {"名字": "雷泽", "所属国家": "蒙德", "生日": "9月9日", "角色属性": "雷", "武器类型": "双手剑", "命之座": "小狼座", "发色": "银发", "瞳色": "红瞳",
          "日文声优": "内山昂辉", "中文声优": "周帅", "称号": "奔狼领的传说", "池子类型": "常驻和限定", "性别": "男"},
    119: {"名字": "砂糖", "所属国家": "蒙德", "生日": "11月26日", "角色属性": "风", "武器类型": "法器", "命之座": "烧瓶座", "发色": "绿发", "瞳色": "橙瞳",
          "日文声优": "藤田茜", "中文声优": "小敢", "称号": "雷莹术士", "池子类型": "常驻和限定", "性别": "女"},
    120: {"名字": "达达利亚", "所属国家": "至冬", "生日": "7月20日", "角色属性": "水", "武器类型": "弓", "命之座": "鲸天座", "发色": "黄发", "瞳色": "蓝瞳",
          "日文声优": "木村良平", "中文声优": "鱼冻", "称号": "玩具销售员", "池子类型": "限定", "性别": "男"},
    121: {"名字": "荧", "所属国家": "???", "生日": "???", "角色属性": "???", "武器类型": "单手剑", "命之座": "旅人座", "发色": "金发", "瞳色": "橙瞳",
          "日文声优": "悠木碧", "中文声优": "宴宁", "称号": "妹妹", "池子类型": "???", "性别": "女"},
    122: {"名字": "空", "所属国家": "???", "生日": "???", "角色属性": "???", "武器类型": "单手剑", "命之座": "旅人座", "发色": "金发", "瞳色": "橙瞳",
          "日文声优": "堀江瞬", "中文声优": "鹿喑", "称号": "哥哥", "池子类型": "???", "性别": "男"},
    123: {"名字": "温迪", "所属国家": "蒙德", "生日": "6月16日", "角色属性": "风", "武器类型": "弓", "命之座": "歌仙座", "发色": "绿发", "瞳色": "绿瞳",
          "日文声优": "村濑步", "中文声优": "喵☆酱", "称号": "摸鱼", "池子类型": "限定", "性别": "男"},
    124: {"名字": "香菱", "所属国家": "璃月", "生日": "11月2日", "角色属性": "火", "武器类型": "长柄武器", "命之座": "长杓座", "发色": "蓝发", "瞳色": "金瞳",
          "日文声优": "小泽亚李", "中文声优": "小N", "称号": "洲际导弹真君", "池子类型": "常驻和限定", "性别": "女"},
    125: {"名字": "行秋", "所属国家": "璃月", "生日": "10月9日", "角色属性": "水", "武器类型": "单手剑", "命之座": "锦织座", "发色": "蓝发", "瞳色": "棕瞳",
          "日文声优": "皆川纯子", "中文声优": "唐雅菁", "称号": "古华飞云", "池子类型": "常驻和限定", "性别": "男"},
    126: {"名字": "辛焱", "所属国家": "璃月", "生日": "10月16日", "角色属性": "火", "武器类型": "双手剑", "命之座": "红檀四弦座", "发色": "黑发", "瞳色": "金瞳",
          "日文声优": "高桥智秋", "中文声优": "王雅欣", "称号": "燥热旋律", "池子类型": "常驻和限定", "性别": "女"},
    127: {"名字": "钟离", "所属国家": "璃月", "生日": "12月31日", "角色属性": "岩", "武器类型": "长柄武器", "命之座": "岩王帝君座", "发色": "黑发", "瞳色": "金瞳",
          "日文声优": "前野智昭", "中文声优": "彭博", "称号": "未来战士", "池子类型": "限定", "性别": "男"},
    128: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    129: {"名字": "诺艾尔", "所属国家": "蒙德", "生日": "3月21日", "角色属性": "岩", "武器类型": "双手剑", "命之座": "心护座", "发色": "银发", "瞳色": "绿瞳",
          "日文声优": "高尾奏音", "中文声优": "宴宁", "称号": "山吹", "池子类型": "常驻和限定", "性别": "女"},
    130: {"名字": "甘雨", "所属国家": "璃月", "生日": "12月2日", "角色属性": "冰", "武器类型": "弓", "命之座": "仙麟座", "发色": "蓝发", "瞳色": "紫瞳",
          "日文声优": "上田丽奈", "中文声优": "林簌", "称号": "椰羊", "池子类型": "限定", "性别": "女"},
    131: {"名字": "魈", "所属国家": "璃月", "生日": "4月17日", "角色属性": "风", "武器类型": "长柄武器", "命之座": "金翅鹏王座", "发色": "绿发", "瞳色": "黄瞳",
          "日文声优": "松冈祯丞", "中文声优": "Kinsen", "称号": "打桩机", "池子类型": "限定", "性别": "男"},
    132: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    133: {"名字": "胡桃", "所属国家": "璃月", "生日": "7月15日", "角色属性": "火", "武器类型": "长柄武器", "命之座": "引蝶座", "发色": "褐发", "瞳色": "红",
          "日文声优": "高桥李依", "中文声优": "陶典", "称号": "雪霁梅香（暂定）", "池子类型": "限定", "性别": "女"},
    134: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    135: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    136: {"名字": "罗莎莉亚", "所属国家": "蒙德", "生日": "4月6日", "角色属性": "冰", "武器类型": "长柄武器", "命之座": "荆冠座", "发色": "白发", "瞳色": "紫瞳",
          "日文声优": "加隈亚衣", "中文声优": "张安琪", "称号": "白色史莱姆", "池子类型": "限定", "性别": "女"},
    137: {"名字": "烟绯", "所属国家": "璃月", "生日": "7月28日", "角色属性": "火", "武器类型": "法器", "命之座": "法兽座", "发色": "粉发",
          "瞳色": "绿瞳",
          "日文声优": "花守由美里", "中文声优": "苏子芜", "称号": "璃月罗翔", "池子类型": "限定", "性别": "女"},
    138: {"名字": "优菈", "所属国家": "蒙德", "生日": "10月25日", "角色属性": "冰", "武器类型": "双手剑", "命之座": "浪沫座", "发色": "蓝发",
          "瞳色": "棕瞳",
          "日文声优": "佐藤利奈", "中文声优": "子音", "称号": "游击小队队长", "池子类型": "限定", "性别": "女"},
    139: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    140: {"名字": "宵宫", "所属国家": "稻妻", "生日": "6月21日", "角色属性": "火", "武器类型": "弓", "命之座": "琉金座", "发色": "金发",
          "瞳色": "金瞳",
          "日文声优": "植田佳奈", "中文声优": "金娜", "称号": "火安柏", "池子类型": "限定", "性别": "女"},
    141: {"名字": "神里绫华", "所属国家": "稻妻", "生日": "9月28日", "角色属性": "冰", "武器类型": "单手剑", "命之座": "雪鹤座", "发色": "白发",
          "瞳色": "金瞳",
          "日文声优": "早见沙织", "中文声优": "小N", "称号": "白鹭公主", "池子类型": "限定", "性别": "女"},
    142: {"名字": "早柚", "所属国家": "稻妻", "生日": "10月19日", "角色属性": "风", "武器类型": "双手剑", "命之座": "小貉座", "发色": "(偏)绿发",
          "瞳色": "紫瞳",
          "日文声优": "洲崎绫", "中文声优": "Sakula小舞", "称号": "忍里之貉", "池子类型": "限定", "性别": "女"},
    143: {"名字": "枫原万叶", "所属国家": "稻妻", "生日": "10月29日", "角色属性": "风", "武器类型": "单手剑", "命之座": "枫红座", "发色": "白发",
          "瞳色": "棕瞳",
          "日文声优": "岛崎信长", "中文声优": "斑马", "称号": "红叶逐荒波", "池子类型": "限定", "性别": "男"},
    144: {"名字": "雷电将军", "所属国家": "稻妻", "生日": "6月26日", "角色属性": "雷", "武器类型": "长柄武器", "命之座": "天下人座", "发色": "紫发",
          "瞳色": "黄瞳",
          "日文声优": "泽城美雪", "中文声优": "菊花花", "称号": "一心净土", "池子类型": "限定", "性别": "女"},
    145: {"名字": "九条裟罗", "所属国家": "稻妻", "生日": "7月14日", "角色属性": "雷", "武器类型": "弓", "命之座": "羽团扇座", "发色": "蓝发",
          "瞳色": "棕瞳",
          "日文声优": "濑户麻沙美", "中文声优": "杨梦露", "称号": "黑羽鸣镝", "池子类型": "限定", "性别": "女"},
    146: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    147: {"名字": "珊瑚宫心海", "所属国家": "稻妻", "生日": "2月22日", "角色属性": "水", "武器类型": "法器", "命之座": "眠龙座", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "三森铃子", "中文声优": "龟娘", "称号": "xhm很喜欢捏", "池子类型": "限定", "性别": "女"},
    148: {"名字": "派蒙", "所属国家": "？？？", "生日": "6月1日", "角色属性": "???", "武器类型": "???", "命之座": "???", "发色": "白发", "瞳色": "蓝瞳",
          "日文声优": "古贺葵", "中文声优": "多多poi", "称号": "应急食品", "池子类型": "???", "性别": "女"},
    149: {"名字": "荒泷一斗", "所属国家": "稻妻", "生日": "6月1日", "角色属性": "岩", "武器类型": "双手剑", "命之座": "天牛座", "发色": "白发",
          "瞳色": "红瞳",
          "日文声优": "西川贵教", "中文声优": "刘照坤", "称号": "花坂豪快", "池子类型": "限定", "性别": "男"},
    150: {"名字": "五郎", "所属国家": "稻妻", "生日": "5月18日", "角色属性": "岩", "武器类型": "弓", "命之座": "柴犬座", "发色": "棕发", "瞳色": "青瞳",
          "日文声优": "畠中祐", "中文声优": "杨昕燃", "称号": "希娜小姐", "池子类型": "常驻UP", "性别": "男"},
    151: {"名字": "申鹤", "所属国家": "璃月", "生日": "3月10日", "角色属性": "冰", "武器类型": "长柄武器", "命之座": "愁疏座", "发色": "白发", "瞳色": "黄瞳",
          "日文声优": "川澄绫子", "中文声优": "秦紫翼", "称号": "中野三玖", "池子类型": "限定", "性别": "女"},
    152: {"名字": "云堇", "所属国家": "璃月", "生日": "5月21日", "角色属性": "岩", "武器类型": "长柄武器", "命之座": "虹章座", "发色": "紫发", "瞳色": "红瞳",
          "日文声优": "小岩井小鸟", "中文声优": "贺文潇", "称号": "应急食品", "池子类型": "常驻UP", "性别": "女"},
    153: {"名字": "托马", "所属国家": "稻妻", "生日": "1月09日", "角色属性": "火", "武器类型": "长柄武器", "命之座": "赤楯座", "发色": "黄发", "瞳色": "绿瞳",
          "日文声优": "森田成一", "中文声优": "张沛", "称号": "地头蛇", "池子类型": "限定", "性别": "男"},
    154: {"名字": "埃洛伊", "所属国家": "？？？", "生日": "4月4日", "角色属性": "冰", "武器类型": "弓", "命之座": "诺拉勇者座", "发色": "棕发", "瞳色": "绿瞳",
          "日文声优": "高垣彩阳", "中文声优": "沐霏", "称号": "异界的救世主", "池子类型": "???", "性别": "女"},

}

WEAPON_NAME = {
    1001: ["无锋剑"],
    1002: ["银剑"],
    1003: ["吃虎鱼刀"],
    1004: ["黎明神剑"],
    1005: ["旅行剑"],
    1006: ["暗铁剑"],
    1007: ["冷刃"],
    1008: ["飞天御剑"],
    1009: ["腐殖之剑"],
    1010: ["黑剑"],
    1011: ["试作斩岩"],
    1012: ["暗巷闪光"],
    1013: ["宗室长剑"],
    1014: ["铁蜂刺"],
    1015: ["笛剑"],
    1016: ["祭礼剑"],
    1017: ["匣里龙吟"],
    1018: ["降临之剑"],
    1019: ["西风剑"],
    1020: ["黑岩长剑"],
    1021: ["磐岩结绿"],
    1022: ["风鹰剑"],
    1023: ["斫峰之刃"],
    1024: ["天空之刃"],
    1025: ["训练大剑"],
    1026: ["佣兵重剑"],
    1027: ["沐浴龙血的剑"],
    1028: ["白铁大剑"],
    1029: ["铁影阔剑"],
    1030: ["飞天大御剑"],
    1031: ["以理服人"],
    1032: ["雨裁"],
    1033: ["白影剑"],
    1034: ["黑岩斩刀"],
    1035: ["宗室大剑"],
    1036: ["祭礼大剑"],
    1037: ["雪葬的星银"],
    1038: ["螭骨剑"],
    1039: ["试作古华"],
    1040: ["西风大剑"],
    1041: ["钟剑"],
    1042: ["千岩古剑"],
    1043: ["天空之傲"],
    1044: ["无工之剑"],
    1045: ["狼的末路"],
    1046: ["猎弓"],
    1047: ["历练的猎弓"],
    1048: ["信使"],
    1049: ["弹弓"],
    1050: ["反曲弓"],
    1051: ["神射手之誓"],
    1052: ["鸦羽弓"],
    1053: ["黑岩战弓"],
    1054: ["试作澹月"],
    1055: ["宗室长弓"],
    1056: ["祭礼弓"],
    1057: ["苍翠猎弓"],
    1058: ["绝弦"],
    1059: ["风花之颂"],
    1060: ["钢轮弓"],
    1061: ["西风猎弓"],
    1062: ["弓藏"],
    1063: ["终末嗟叹之诗"],
    1064: ["天空之翼"],
    1065: ["阿莫斯之弓"],
    1066: ["学徒笔记"],
    1067: ["口袋魔导书"],
    1068: ["异世界行记"],
    1069: ["翡玉法球"],
    1070: ["甲级宝珏"],
    1071: ["魔导绪论"],
    1072: ["讨龙英杰谭"],
    1073: ["万国诸海图谱"],
    1074: ["昭心"],
    1075: ["暗巷的酒与诗"],
    1076: ["宗室秘法录"],
    1077: ["流浪乐章"],
    1078: ["匣里日月"],
    1079: ["西风秘典"],
    1080: ["忍冬之果"],
    1081: ["试作金珀"],
    1082: ["祭礼残章"],
    1083: ["黑岩绯玉"],
    1084: ["四风原典"],
    1085: ["天空之卷"],
    1086: ["尘世之锁"],
    1087: ["新手长枪"],
    1088: ["铁尖枪"],
    1089: ["黑缨枪"],
    1090: ["钺矛"],
    1091: ["白缨枪"],
    1092: ["流月针"],
    1093: ["匣里灭辰"],
    1094: ["千岩长枪"],
    1095: ["试作星镰"],
    1096: ["黑岩刺枪"],
    1097: ["西风长枪"],
    1098: ["龙脊长枪"],
    1099: ["决斗之枪"],
    1100: ["宗室猎枪"],
    1101: ["护摩之杖"],
    1102: ["和璞鸢"],
    1103: ["天空之脊"],
    1104: ["贯虹之槊"],
}

WEAPON_PROFILE = {
    1001: {"名字": "无锋剑", "类型": "单手剑", "稀有度": "1星"
        , "获取途径": "初始武器赠送, 宝箱, 商店购买"
        , "初始基础攻击力": "23", "副属性": "无"},
    1002: {"名字": "银剑", "类型": "单手剑", "稀有度": "2星"
        , "获取途径": "宝箱, 商店购买"
        , "初始基础攻击力": "33", "副属性": "无"},
    1003: {"名字": "吃虎鱼刀", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "宝箱"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1004: {"名字": "黎明神剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "祈愿, 任务, （海盗密保孔雀羽之章）"
        , "初始基础攻击力": "39", "副属性": "暴击伤害"},
    1005: {"名字": "旅行剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "宝箱"
        , "初始基础攻击力": "40", "副属性": "防御力"},
    1006: {"名字": "暗铁剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "与璃月港小吃摊摊主快刀陈对话“鱼卖得怎样”, 对话"
        , "初始基础攻击力": "39", "副属性": "元素精通"},
    1007: {"名字": "冷刃", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1008: {"名字": "飞天御剑", "类型": "单手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "38", "副属性": "元素充能效率"},
    1009: {"名字": "腐殖之剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "活动"
        , "初始基础攻击力": "42", "副属性": "元素充能效率"},
    1010: {"名字": "黑剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "纪行"
        , "初始基础攻击力": "42", "副属性": "暴击率"},
    1011: {"名字": "试作斩岩", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "锻造"
        , "初始基础攻击力": "44", "副属性": "物理伤害加成"},
    1012: {"名字": "暗巷闪光", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "限定祈愿"
        , "初始基础攻击力": "45", "副属性": "元素精通"},
    1013: {"名字": "宗室长剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "商城兑换"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1014: {"名字": "铁蜂刺", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "锻造"
        , "初始基础攻击力": "42", "副属性": "元素精通"},
    1015: {"名字": "笛剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1016: {"名字": "祭礼剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "41", "副属性": "元素充能效率"},
    1017: {"名字": "匣里龙吟", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1018: {"名字": "降临之剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "PS4特典奖励"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1019: {"名字": "西风剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "41", "副属性": "元素充能效率"},
    1020: {"名字": "黑岩长剑", "类型": "单手剑", "稀有度": "4星"
        , "获取途径": "商城兑换"
        , "初始基础攻击力": "44", "副属性": "暴击伤害"},
    1021: {"名字": "磐岩结绿", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "44", "副属性": "暴击率"},
    1022: {"名字": "风鹰剑", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "48", "副属性": "物理伤害加成"},
    1023: {"名字": "斫峰之刃", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "46", "副属性": "百分比攻击力"},
    1024: {"名字": "天空之刃", "类型": "单手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "46", "副属性": "元素充能效率"},
    1025: {"名字": "训练大剑", "类型": "双手剑", "稀有度": "1星"
        , "获取途径": "初始武器赠送, 宝箱, 商店购买"
        , "初始基础攻击力": "23", "副属性": "无"},
    1026: {"名字": "佣兵重剑", "类型": "双手剑", "稀有度": "2星"
        , "获取途径": "宝箱, 商店购买"
        , "初始基础攻击力": "33", "副属性": "无"},
    1027: {"名字": "沐浴龙血的剑", "类型": "双手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "38", "副属性": "元素精通"},
    1028: {"名字": "白铁大剑", "类型": "双手剑", "稀有度": "3星"
        , "获取途径": "宝箱"
        , "初始基础攻击力": "39", "副属性": "防御力"},
    1029: {"名字": "铁影阔剑", "类型": "双手剑", "稀有度": "3星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "39", "副属性": "生命值"},
    1030: {"名字": "飞天大御剑", "类型": "双手剑", "稀有度": "3星"
        , "获取途径": "孤云阁附近拔出, 宝箱"
        , "初始基础攻击力": "39", "副属性": "物理伤害加成"},
    1031: {"名字": "以理服人", "类型": "双手剑", "稀有度": "3星"
        , "获取途径": "祈愿, 宝箱"
        , "初始基础攻击力": "39", "副属性": "攻击力"},
    1032: {"名字": "雨裁", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "元素精通"},
    1033: {"名字": "白影剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "锻造"
        , "初始基础攻击力": "42", "副属性": "防御力"},
    1034: {"名字": "黑岩斩刀", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "商城兑换"
        , "初始基础攻击力": "42", "副属性": "暴击伤害"},
    1035: {"名字": "宗室大剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "商城兑换"
        , "初始基础攻击力": "44", "副属性": "百分比攻击力"},
    1036: {"名字": "祭礼大剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "44", "副属性": "元素充能效率"},
    1037: {"名字": "雪葬的星银", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "锻造, 任务"
        , "初始基础攻击力": "44", "副属性": "物理伤害加成"},
    1038: {"名字": "螭骨剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "纪行"
        , "初始基础攻击力": "42", "副属性": "暴击率"},
    1039: {"名字": "试作古华", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "锻造"
        , "初始基础攻击力": "44", "副属性": "百分比攻击力"},
    1040: {"名字": "西风大剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "41", "副属性": "元素充能效率"},
    1041: {"名字": "钟剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "生命值"},
    1042: {"名字": "千岩古剑", "类型": "双手剑", "稀有度": "4星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "42", "副属性": "攻击力"},
    1043: {"名字": "天空之傲", "类型": "双手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "48", "副属性": "元素充能效率"},
    1044: {"名字": "无工之剑", "类型": "双手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "46", "副属性": "百分比攻击力"},
    1045: {"名字": "狼的末路", "类型": "双手剑", "稀有度": "5星"
        , "获取途径": "祈愿"
        , "初始基础攻击力": "46", "副属性": "百分比攻击力"},
    # 1046: {"名字":"猎弓","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"},
    # 1047: {"名字":"无锋剑","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"历练的猎弓"],
    # 1048: {"名字":"无锋剑","类型":"单手剑","稀有度":"2星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"信使"],
    # 1049: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"弹弓"],
    # 1050: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"反曲弓"],
    # 1051: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"神射手之誓"],
    # 1052: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"鸦羽弓"],
    # 1053: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑岩战弓"],
    # 1054: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"试作澹月"],
    # 1055: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"宗室长弓"],
    # 1056: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"祭礼弓"],
    # 1057: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"苍翠猎弓"],
    # 1058: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"绝弦"],
    # 1059: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"风花之颂"],
    # 1060: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"钢轮弓"],
    # 1061: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"西风猎弓"],
    # 1062: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"弓藏"],
    # 1063: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"终末嗟叹之诗"],
    # 1064: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"天空之翼"],
    # 1065: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"阿莫斯之弓"],
    # 1066: {"名字":"无锋剑","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"学徒笔记"],
    # 1067: {"名字":"无锋剑","类型":"单手剑","稀有度":"2星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"口袋魔导书"],
    # 1068: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"异世界行记"],
    # 1069: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"翡玉法球"],
    # 1070: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"甲级宝珏"],
    # 1071: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"魔导绪论"],
    # 1072: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"讨龙英杰谭"],
    # 1073: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"万国诸海图谱"],
    # 1074: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"昭心"],
    # 1075: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"暗巷的酒与诗"],
    # 1076: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"宗室秘法录"],
    # 1077: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"流浪乐章"],
    # 1078: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"匣里日月"],
    # 1079: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"西风秘典"],
    # 1080: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"忍冬之果"],
    # 1081: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"试作金珀"],
    # 1082: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"祭礼残章"],
    # 1083: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑岩绯玉"],
    # 1084: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"四风原典"],
    # 1085: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"天空之卷"],
    # 1086: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"尘世之锁"],
    # 1087: {"名字":"无锋剑","类型":"单手剑","稀有度":"1星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"新手长枪"],
    # 1088: {"名字":"无锋剑","类型":"单手剑","稀有度":"2星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"铁尖枪"],
    # 1089: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑缨枪"],
    # 1090: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"钺矛"],
    # 1091: {"名字":"无锋剑","类型":"单手剑","稀有度":"3星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"白缨枪"],
    # 1092: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"流月针"],
    # 1093: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"匣里灭辰"],
    # 1094: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"千岩长枪"],
    # 1095: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"试作星镰"],
    # 1096: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"黑岩刺枪"],
    # 1097: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"西风长枪"],
    # 1098: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"龙脊长枪"],
    # 1099: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"决斗之枪"],
    # 1100: {"名字":"无锋剑","类型":"单手剑","稀有度":"4星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"宗室猎枪"],
    # 1101: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"护摩之杖"],
    # 1102: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"和璞鸢"],
    # 1103: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"天空之脊"],
    # 1104: {"名字":"无锋剑","类型":"单手剑","稀有度":"5星"
    #        ,"获取途径":"祈愿"
    #        ,"初始基础攻击力":"23","副属性":"无"}"贯虹之槊"],
}
SETU_NAME = {
    1001: ["派蒙"],
    1002: ["芭芭拉"],
    1003: ["可莉"],
    1004: ["派蒙"],
    1005: ["可莉"],
    1006: ["甘雨"],
    1007: ["可莉"],
    1008: ["派蒙"],
    1009: ["可莉"],
    1010: ["可莉"],
    1011: ["可莉"],
    1012: ["可莉"],
    1013: ["迪奥娜"],
    1014: ["可莉"],
    1015: ["可莉"],
    1016: ["菲谢尔"],
    1017: ["香菱"],
    1018: ["可莉"],
    1019: ["可莉"],
    1020: ["可莉"],
    1021: ["宵宫"],
    1022: ["珊瑚宫心海"],
    1023: ["可莉"],
    1024: ["可莉"],
    1025: ["可莉"],
    1026: ["可莉"],
    1028: ["刻晴"],
    1029: ["宵宫"],
    1030: ["胡桃"],
    1031: ["芭芭拉"],
    1032: ["菲谢尔"],
    1033: ["莫娜"],
    1034: ["派蒙"],
    1035: ["刻晴"],
    1036: ["甘雨"],
    1037: ["可莉"],
    1038: ["可莉"],
    1039: ["可莉"],
    1040: ["可莉"],
    1041: ["芭芭拉"],
    1042: ["可莉"],
    1043: ["可莉"],
    1044: ["可莉"],
    1045: ["可莉"],
    1046: ["可莉"],
    1047: ["可莉"],
    1048: ["八重神子"],
    1049: ["荧"],
    1050: ["荧"],
    1051: ["珊瑚宫心海"],
    1052: ["芭芭拉"],
    1053: ["菲谢尔"],
    1054: ["七七"],
    1055: ["荧"],
    1056: ["刻晴"],
    1057: ["七七"],
    1058: ["胡桃"],
    1059: ["胡桃"],
    1060: ["荧"],
    1061: ["可莉"],
    1062: ["神里绫华"],
    1063: ["胡桃"],
    1064: ["可莉"],
    1065: ["托马"],
    1066: ["早柚"],
    1067: ["早柚"],
    1068: ["荧"],
    1069: ["可莉"],
    1070: ["空"],
    1071: ["胡桃"],
    1072: ["莫娜"],
    1073: ["刻晴"],
    1074: ["可莉"],
    1075: ["可莉"],
    1076: ["可莉"],
    1077: ["可莉"],
    1078: ["可莉"],
    1079: ["香菱"],
    1080: ["空"],
    1081: ["迪奥娜"],
    1082: ["托马"],
    1083: ["甘雨"],
    1084: ["胡桃"],
    1085: ["丽莎"],
    1086: ["优菈"],
    1087: ["甘雨"],
    1088: ["可莉"],
    1089: ["可莉"],
    1090: ["荧"],
    1091: ["胡桃"],
    1092: ["甘雨"],
    1093: ["甘雨"],
    1094: ["诺艾尔"],
    1095: ["珊瑚宫心海"],
    1096: ["神里绫华"],
    1097: ["珊瑚宫心海"],
    1098: ["荧"],
    1099: ["可莉"],
    1100: ["宵宫"],
    1101: ["烟绯"],
    1102: ["荧"],
    1103: ["荧"],
    1104: ["荧"],
    1105: ["荧"],
    1106: ["荧"],
    1107: ["荧"],
    1108: ["枫原万叶"],
    1109: ["早柚"],
    1110: ["菲谢尔"],
    1111: ["瑶瑶"],
    1112: ["甘雨"],
    1113: ["迪奥娜"],
    1114: ["菲谢尔"],
    1115: ["胡桃"],
    1116: ["芭芭拉"],
    1117: ["芭芭拉"],
    1118: ["荧"],
    1119: ["安柏"],
    1120: ["瑶瑶"],
    1121: ["莫娜"],
    1122: ["胡桃"],
    1123: ["甘雨"],
    1124: ["莫娜"],
    1125: ["安柏"],
    1126: ["荧"],
    1127: ["荧"],
    1128: ["胡桃"],
    1129: ["胡桃"],
    1130: ["七七"],
    1131: ["刻晴"],
    1132: ["荧"],
    1133: ["烟绯"],
    1134: ["荧"],
    1135: ["荧"],
    1136: ["可莉"],
    1137: ["可莉"],
    1138: ["可莉"],
    1139: ["神里绫华"],
    1140: ["迪奥娜"],
    1141: ["神里绫华"],
    1142: ["神里绫华"],
    1143: ["神里绫华"],
    1144: ["胡桃"],
    1145: ["珊瑚宫心海"],
    1146: ["芭芭拉"],
    1147: ["安柏"],
    1148: ["雷电将军"],
    1149: ["早柚"],
    1150: ["神里绫华"],
    1151: ["珊瑚宫心海"],
    1152: ["早柚"],
    1153: ["芭芭拉"],
    1154: ["芭芭拉"],
    1155: ["甘雨"],
    1156: ["甘雨"],
    1157: ["甘雨"],
    1158: ["宵宫"],
    1159: ["刻晴"],
    1160: ["雷电将军"],
    1161: ["雷电将军"],
    1162: ["雷电将军"],
    1163: ["八重神子"],
    1164: ["诺艾尔"],
    1165: ["诺艾尔", "荧"],
    1166: ["七七"],
    1167: ["七七"],
    1168: ["七七"],
    1169: ["珊瑚宫心海"],
    1170: ["珊瑚宫心海"],
    1171: ["神里绫华"],
    1172: ["莫娜"],
    1173: ["宵宫"],
    1174: ["珊瑚宫心海"],
    1175: ["烟绯"],
    1176: ["烟绯"],
    1177: ["雷电将军"],
    1178: ["甘雨", "丽莎"],
    1179: ["可莉"],
    1180: ["莫娜"],
    1181: ["可莉"],
    1182: ["安柏"],
    1183: ["可莉"],
    1184: ["珊瑚宫心海"],
    1185: ["雷电将军"],
    1186: ["刻晴", "甘雨"],
    1187: ["莫娜"],
    1188: ["阿贝多"],
    1189: ["雷电将军"],
    1190: ["甘雨"],
    1191: ["莫娜"],
    1192: ["甘雨"],
    1201: ["芭芭拉"],
    1202: ["甘雨"],
    1203: ["芭芭拉","琴"],
    1204: ["优菈"],
    1205: ["八重神子"],
    1206: ["钟离"],
    1207: ["钟离"],
    1208: ["甘雨"],
    1209: ["甘雨"],
    1210: ["甘雨"],
    1211: ["神里绫华"],
    1212: ["莫娜"],
    1213: ["甘雨"],
    1214: ["宵宫"],
    1215: ["宵宫"],
    1216: ["菲谢尔"],
    1217: ["早柚"],
    1218: ["雷电将军"],
    1219: ["雷电将军"],
    1220: ["雷电将军"],
    1221: ["雷电将军"],
    1222: ["雷电将军"],
    1223: ["甘雨"],
    1224: ["甘雨"],
    1225: ["雷电将军"],
    1226: ["八重神子"],
    1227: ["雷电将军"],
    1228: ["雷电将军"],
    1229: ["九条裟罗"],
    1230: ["可莉"],
    1231: ["可莉"],
    1232: ["可莉"],
    1233: ["可莉"],
    1234: ["迪奥娜"],
    1235: ["迪奥娜"],
    1236: ["可莉"],
    1237: ["迪奥娜"],
    1238: ["可莉"],
    1239: ["可莉"],
    1240: ["琴"],
    1241: ["莫娜"],
    1242: ["可莉"],
    1243: ["胡桃"],
    1244: ["琴","迪卢克"],
    1245: ["琴","迪卢克"],
    1246: ["凝光"],
    1247: ["可莉"],
    1248: ["迪奥娜"],
    1249: ["迪奥娜"],
    1250: ["七七"],
    1251: ["莫娜"],
    1252: ["派蒙"],
    1253: ["菲谢尔"],
    1254: ["可莉"],
    1255: ["迪奥娜"],
    1256: ["早柚"],
    1257: ["早柚","七七"],
    1258: ["胡桃"],
    1259: ["荧"],
    1260: ["胡桃"],
    1261: ["神里绫华"],
    1262: ["琴"],
    1263: ["神里绫华"],
    1264: ["可莉"],
    1265: ["早柚"],
    1266: ["宵宫"],
    1267: ["莫娜"],
    1268: ["刻晴"],
    1269: ["雷电将军"],
    1270: ["荧"],
    1271: ["珊瑚宫心海"],
    1272: ["莫娜"],
    1273: ["雷电将军"],
    1274: ["雷电将军"],
    1275: ["早柚"],
    1276: ["雷电将军"],
    1277: ["雷电将军"],
    1278: ["雷电将军"],
    #1279: ["雷电将军"],
    1280: ["香菱"],
    1281: ["香菱"],
    1282: ["芭芭拉","琴"],
    1283: ["安柏"],
    1284: ["魈"],
    1285: ["荧"],
    1286: ["荧"],
    1287: ["荧"],
    1288: ["可莉"],
    1289: ["可莉"],
    1290: ["可莉"],
    1291: ["刻晴"],
    1292: ["荧"],
    1293: ["七七"],
    1294: ["香菱"],
    1295: ["七七"],
    1296: ["七七"],
    1297: ["菲谢尔"],
    1298: ["菲谢尔"],
    1299: ["可莉"],
    1300: ["七七"],
    1301: ["派蒙","荧"],
    1302: ["温迪"],
    1303: ["芭芭拉"],
    1304: ["安柏"],
    1305: ["派蒙","温迪"],
    1306: ["荧"],
    1307: ["菲谢尔"],
    1308: ["派蒙"],
    1309: ["可莉"],
    1310: ["香菱"],
    1311: ["可莉"],
    1312: ["可莉"],
    1313: ["刻晴"],
    1314: ["可莉"],
    1315: ["七七"],
    1316: ["刻晴"],
    1317: ["菲谢尔"],
    1318: ["可莉","七七"],
    1319: ["可莉","七七"],
    1320: ["迪奥娜"],
    1321: ["荧"],
    1322: ["荧"],
    1323: ["七七"],
    1324: ["可莉"],
    1325: ["七七"],
    1326: ["可莉"],
    1327: ["可莉"],
    1328: ["七七"],
    1329: ["荧"],
    1330: ["可莉"],
    1331: ["可莉"],
    1332: ["刻晴"],
    1333: ["香菱"],
    1334: ["刻晴"],
    1335: ["可莉","七七"],
    #1336: ["可莉","七七"],
    1337: ["七七"],
    1338: ["刻晴"],
    1339: ["菲谢尔"],
    1340: ["七七"],
    1341: ["荧"],
    1342: ["可莉"],
    1343: ["荧"],
    1344: ["可莉"],
    1345: ["刻晴"],
    1346: ["荧"],
    #1347: ["可莉"],
    1348: ["可莉","七七"],
    1349: ["可莉"],
    1350: ["荧"],
    1351: ["七七"],
    1352: ["可莉"],
    1353: ["七七"],
    1354: ["可莉"],
    1355: ["可莉"],
    1356: ["可莉"],
    1357: ["可莉"],
    1358: ["可莉"],
    1359: ["可莉"],
    1360: ["可莉"],
    1361: ["可莉"],
    1362: ["可莉"],
    1363: ["刻晴"],
   # 1364: ["诺艾尔"],
    1365: ["荧"],
    1366: ["可莉"],
    1367: ["七七","可莉"],
    1368: ["胡桃"],
    1369: ["可莉"],
    1370: ["七七"],
    1371: ["可莉"],
    1372: ["七七","可莉"],
    1373: ["刻晴"],
    1374: ["可莉"],
    1375: ["甘雨"],
    1376: ["荧"],
    1377: ["甘雨"],
    1378: ["芭芭拉"],
    1379: ["荧"],
    1380: ["诺艾尔"],
    #1381: ["可莉"],
    1382: ["优菈"],
    1383: ["刻晴"],
    1384: ["优菈"],
    1385: ["迪奥娜"],
    1386: ["七七"],
    1387: ["刻晴"],
    1388: ["荧"],
    1389: ["可莉"],
    1390: ["可莉"],
    1391: ["甘雨"],
    1392: ["甘雨"],
    1393: ["丽莎"],
    1394: ["刻晴"],
    1395: ["优菈"],
    1396: ["珊瑚宫心海"],
    #1397: ["早柚"],
    1398: ["神里绫华"],
    1399: ["神里绫华"],
    #1400: ["可莉"],
    1401: ["迪奥娜"],
    1402: ["可莉"],
    1403: ["安柏"],
    1404: ["荧","派蒙"],
    1405: ["神里绫华"],
    #1406: ["神里绫华"],
    1407: ["可莉"],
    1408: ["可莉"],
    1409: ["神里绫华"],
    1410: ["珊瑚宫心海"],
    1411: ["珊瑚宫心海"],
    1412: ["雷电将军"],
    1413: ["神里绫华"],
    1414: ["早柚"],
    #1415: ["神里绫华"],
    1416: ["早柚"],
    1417: ["香菱"],
    1418: ["可莉"],
    1419: ["砂糖"],
    1420: ["派蒙","迪奥娜","七七","早柚","可莉"],
    1421: ["可莉"],
    1422: ["珊瑚宫心海"],
    1423: ["早柚"],
    1424: ["迪奥娜","七七","早柚","可莉"],
    1425: ["珊瑚宫心海"],
    1426: ["雷电将军"],
   # 1427: ["雷电将军"],
    1428: ["可莉"],
    1429: ["珊瑚宫心海"],
    1430: ["诺艾尔"],
    1431: ["刻晴"],
    1432: ["可莉","七七"],
    1433: ["迪奥娜","七七","早柚","可莉"],
    1434: ["可莉","七七"],
    1435: ["迪奥娜","早柚"],
    1436: ["可莉"],
    1437: ["珊瑚宫心海"],
    #1438: ["静流"],
    1439: ["珊瑚宫心海","八重神子","雷电将军"],
    1440: ["珊瑚宫心海"],
    #1441: ["神里绫华"],
    1442: ["雷电将军","九条裟罗"],
    1443: ["雷电将军"],
    1444: ["珊瑚宫心海"],
    1445: ["珊瑚宫心海"],
    1446: ["珊瑚宫心海"],
}
